Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh3808-v3.tmx
Source language: bo
Languages: en

source: །གང་གི་ཚེ་ནུབ་ཕྱོགས་ཀྱི་ས་དང་ཤིང་དང་རི་ལ་སོགས་པ་རབ་ཏུ་འཁྲུགས་པར་གྱུར་པ་དེའི་ཚེ་ནུབ་ཕྱོགས་མཐོ་བ་འདྲ་བར་སྣང་ཞིང་ཤར་ཕྱོགས་རང་བཞིན་དུ་གནས་ཀྱང་དམའ་བ་འདྲ་བར་སྣང་ངོ་།
en: When the ground, trees, and mountains and so on in the western direction are greatly disturbed it looks like the western direction is raised up. When it looks like the western direction is raised up, even though the eastern direction remains in its natural state it looks like it has sunk down.

source: །གཟུགས་ཀྱི་རྗེས་སུ་མ་སྐྱེས། གཟུགས་ལས་གཞན་གྱི་རྗེས་སུ་མ་སྐྱེས་སོ་ཞེས་བྱ་བ་ནི་གཟུགས་སྐྱེ་བར་འགྱུར་བའི་དངོས་པོ་མེད་པས་གནས་བརྟན་ཡང་དངོས་པོ་མེད་པའི་ཕྱིར་གཟུགས་ཀྱི་རྗེས་སུ་སྐྱེ་བའམ།
en: Synonyms of suchness “Does not take after form, does not take after anything other than form”— since a form aggregate that might come into being is nonexistent, the elder is also nonexistent, so it is not feasible that he takes after form or takes after anything else at all other than form.

source: གཟུགས་ལས་གཞན་པ་གང་དུ་ཡང་སྐྱེ་བར་མི་རིགས་སོ། །དེ་བཞིན་ཉིད་ཀྱང་སྐྱེ་བ་དང་འབྲེལ་པ་མེད་པས་དེ་བཞིན་ཉིད་ཀྱི་རྗེས་སུ་སྐྱེ་བའམ། དེ་བཞིན་ཉིད་ལས་གཞན་པ་གང་དུ་ཡང་མི་རིགས་སོ།
en: And it is not feasible that he takes after “the suchness of form,” or takes after anything at all “other than the suchness of form,” because suchness is unconnected with being born as well. “

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་ཉིད་དང་མ་ནོར་བ་དེ་བཞིན་ཉིད་དང་གཞན་མ་ཡིན་པ་དེ་བཞིན་ཉིད་ཟབ་པོ་ཞེས་བྱ་བ་ལ་སོགས་པ་ནི་དེ་བཞིན་གཤེགས་པའི་དངོས་པོ་ནི་དེ་བཞིན་ཉིད་དོ།
en: Lord, suchness, unmistaken suchness, unaltered suchness are deep,” and so on. To be a tathāgata is suchness.

source: །མ་ནོར་བའི་དངོས་པོ་ནི་མ་ནོར་བའི་དེ་བཞིན་ཉིད་དོ།
en: To be unmistaken is unmistaken suchness.

source: །གཞན་མ་ཡིན་པའི་དངོས་པོ་ནི་གཞན་མ་ཡིན་པ་དེ་བཞིན་ཉིད་དེ།
en: To be unaltered is unaltered suchness.

source: ཆོས་རྣམས་ཀྱི་བརྗོད་དུ་མེད་པའི་མཚན་ཉིད་ཡོངས་སུ་གྲུབ་པ་དོན་དམ་པའི་དབྱིངས་གང་ཡིན་པ་དེ་ནི་དུས་ཐམས་ཅད་དུ་དེ་བཞིན་ཉིད་དུ་འགྱུར་ཞིང་། ནོར་བར་མི་འགྱུར་གཞན་དུ་མི་འགྱུར་བའི་ཕྱིར་དེ་བཞིན་ཉིད་དང་མ་ནོར་བ་དེ་བཞིན་ཉིད་དང་གཞན་མ་ཡིན་པ་དེ་བཞིན་ཉིད་ཅེས་བྱའོ།
en: It says “suchness, unmistaken suchness, and unaltered suchness” because the thoroughly established phenomenon marked by the inexpressibility of dharmas, the ultimate element, is at all times suchness, is not a mistake, and does not alter.

source: །ཡོངས་སུ་གྲུབ་པའི་མཚན་ཉིད་ནི་རྣམ་པ་གསུམ་སྟེ། མི་འཇིག་པར་ཡོངས་སུ་གྲུབ་པ་དང་། ཕྱིན་ཅི་མ་ལོག་པར་ཡོངས་སུ་གྲུབ་པ་དང་།
en: The mark of the thoroughly established phenomenon is threefold: it is a thoroughly established phenomenon that is indestructible, it is a thoroughly established phenomenon without error, and it is a thoroughly established phenomenon that does not alter.

source: མི་འགྱུར་བར་ཡོངས་སུ་གྲུབ་པའོ། །དེ་ལ་མི་འཇིག་པར་ཡོངས་སུ་གྲུབ་པའི་ཕྱིར་དེ་བཞིན་ཉིད་དོ། །ཕྱིན་ཅི་མ་ལོག་པར་ཡོངས་སུ་གྲུབ་པའི་ཕྱིར་མ་ནོར་བ་དེ་བཞིན་ཉིད་དོ། །མི་འགྱུར་བར་ཡོངས་སུ་གྲུབ་པའི་ཕྱིར་གཞན་མ་ཡིན་པ་དེ་བཞིན་ཉིད་དོ།
en: It is suchness because it is a thoroughly established phenomenon that is indestructible; it is unmistaken suchness because it is a thoroughly established phenomenon without error; and it is unaltered suchness because it is a thoroughly established phenomenon that does not alter.

source: །ཆོས་ཉིད་དང་ཆོས་ཀྱི་དབྱིངས་དང་ཆོས་གནས་པ་ཉིད་ཅེས་བྱ་བ་ཚིག་གསུམ་གྱིས་མཚན་ཉིད་རྣམ་པ་གསུམ་བསྟན་ཏེ། ཆོས་ཀྱི་མཚན་ཉིད་དང་། འབྱུང་གནས་ཀྱི་མཚན་ཉིད་དང་། གནས་པའི་མཚན་ཉིད་དོ།
en: The three terms— “true nature of dharmas, dharma-constituent, and establishment of dharmas”— teach three marks: the mark of the dharma, the mark of the origin, and the mark of what is established.

source: །ཆོས་ཀྱི་དངོས་པོ་ནི་ཆོས་ཉིད་དེ་ཀུན་བརྟགས་པ་དང་།
en: The state of the dharma is the attribute that is the true nature.

source: རྣམ་པར་བརྟགས་པའི་ཆོས་ཐམས་ཅད་ལས་གཞན་དུ་གྱུར་པ་ན་དེ་དང་མི་འདྲ་བ་བརྗོད་དུ་མེད་པ་ཆོས་ཀྱི་དངོས་པོར་གནས་པ་གང་ཡིན་པ་དེ་གནས་པའི་ཕྱིར་ཆོས་ཉིད་ཀྱི་སྒྲར་བརྗོད་དོ།
en: It is in a form different from all falsely imagined and conceptualized attributes, so that which is established as the state of the dharma, dissimilar to them, and inexpressible, is expressed by the name “true nature of dharmas” because it is established. “

source: །ཆོས་ཀྱི་དབྱིངས་ཞེས་བྱ་བ་ནི་འབྱུང་གནས་ཀྱི་མཚན་ཉིད་གསུངས་པ་སྟེ།
en: Dharma-constituent” is said to mark the origin.

source: ཆོས་ནི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་དང་། མ་འདྲེས་པ་ལ་སོགས་པ་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་སོ།
en: The “dharmas” are the ten powers, the fearlessnesses, the distinct attributes of a buddha, and so on.

source: །དབྱིངས་ཀྱི་སྒྲ་ནི་རྒྱུའི་དོན་ཏེ་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཀྱི་འབྱུང་གནས་ཡིན་པའི་ཕྱིར་ཆོས་ཀྱི་དབྱིངས་ཞེས་བྱ་སྟེ་ཆོས་ཀྱི་སྐུ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: The term element means cause, so, because it is the origin of the buddhadharmas, it is the “dharma-constituent,” which is to say, the “dharma body.” “

source: །ཆོས་གནས་པ་ཉིད་ཅེས་བྱ་བ་ནི་གནས་པའི་མཚན་ཉིད་གསུངས་པ་སྟེ།
en: Establishment of dharmas” is said to mark what is established.

source: དེ་བཞིན་གཤེགས་པ་རྣམས་བྱུང་ཡང་རུང་མ་བྱུང་ཡང་རུང་ཆོས་ཉིད་དང་།
en: As it is said, “Whether the tathāgatas arise or whether the tathāgatas do not arise, the true nature of dharmas and establishment of dharmas are indeed established.”

source: ཆོས་གནས་པ་ཉིད་འདི་ནི་འདུག་པ་ཉིད་དོ་ཞེས་ཇི་སྐད་དུ་གསུངས་པ་ལྟ་བུ་སྟེ་དོན་དམ་པ་བརྗོད་དུ་མེད་པས་ཡོངས་སུ་གྲུབ་པའི་ཆོས་ནི་སྔོན་དྲི་མ་དང་བཅས་པའི་གནས་སྐབས་དང་ཕྱིས་དྲི་མ་མེད་པའི་གནས་སྐབས་ན་ཡང་དུས་ཐམས་ཅད་དུ་ཡོད་པ་ནི་ཆོས་གནས་པ་ཉིད་དོ།
en: Because it is the inexpressible ultimate, the dharma that is thoroughly established, constantly there during the prior period when it is together with stains and also during the later period when there are no stains, it is the establishment of dharmas.

source: །ཆོས་སྐྱོན་མེད་པ་ཉིད་དང་། ཡང་དག་པའི་མཐའ་དང་། བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་ཞེས་བྱ་བ་ཚིག་གསུམ་གྱིས་ངེས་པའི་མཚན་ཉིད་གསུངས་ཏེ།
en: The three terms— “the certification of dharmas, the very limit of reality, and the inconceivable element”— are speaking about what is marked by restriction.

source: དེ་ལ་ཆོས་སྐྱོན་མེད་པ་ཉིད་ཅེས་བྱ་བ་ལ་ཆོས་ནི་འདིར་ལོག་པའི་ཆོས་ལས་བཟློག་པ།
en: Among these, in “the certification of dharmas” the dharmas are the perfect state dharmas, the reverse of the mistaken dharmas.

source: ཡང་དག་པ་ཉིད་ཀྱི་ཆོས་ཏེ་དེ་དག་ལ་ངེས་པ་ཉིད་དང་།
en: The certification of them is the state in which they are secure, the state restricted to those alone.

source: གཅིག་ཏུ་ཆད་པ་ཉིད་ནི་སྐྱོན་མེད་པ་ཉིད་དེས་རབ་ཏུ་དགའ་བའི་ཡེ་ཤེས་ཀྱིས་དང་པོ་ཉིད་དུ་དེ་བཞིན་ཉིད་རབ་ཏུ་རྟོགས་པས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ངེས་པར་འགྱུར་གྱི་གཞན་དུ་ནི་མ་ཡིན་ནོ།
en: Through that state they awaken to suchness at the very first with knowledge at the Joyful level and are certified to fully awaken to unsurpassed, perfect, complete awakening, not otherwise.

source: །དེ་བས་ན་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སོགས་པ་སངས་རྒྱས་བྱེད་པ་ཡང་དག་པ་ཉིད་ཀྱི་ཆོས་རྣམས་ཀྱི་ངེས་པའི་རྒྱུ་ཡིན་པའི་ཕྱིར་ཆོས་སྐྱོན་མེད་པ་ཉིད་ཅེས་བྱ་སྟེ་འདི་སྐད་དུ་ཡང་དག་པ་ཉིད་སྐྱོན་མེད་པ་ལ་ཞུགས་པ་ཡིན་ནོ་ཞེས་གསུངས་པའི་ཕྱིར་རོ། །ཡང་ན་སྐྱོན་ཞེས་བྱ་བ་ནི་ཆོས་ལ་སྲེད་པ་སྟེ།
en: Therefore, it is called the “certification of dharmas” because it is the cause restricting dharmas (the perfections and so on making up a buddha) to the perfect state, because it said, “Those who have entered into the flawlessness that is a perfect state…” Alternatively, the “flaw” is craving for the dharmas.

source: སྐྱོན་གྱི་དངོས་པོ་མེད་པ་ནི་སྐྱོན་མེད་པ་ཉིད་དོ་ཞེས་སྔར་ཇི་སྐད་དུ་བསྟན་པ་ལྟ་བུའོ།
en: The nonexistence of the flaw is the flawlessness as explained before.

source: །ཆོས་རྣམས་ལ་སྐྱོན་མེད་པ་ཉིད་ནི་ཆོས་སྐྱོན་མེད་པ་ཉིད་དེ།
en: The flawlessness in respect to dharmas is the “certification of dharmas.”

source: ཆོས་གང་རབ་ཏུ་རྟོགས་པས་སྐྱོན་གྱི་ཆོས་རྣམས་རྒྱུན་བཅད་པ་དེ་ལ་ཆོས་སྐྱོན་མེད་པ་ཉིད་ཅེས་བྱའོ།
en: The “certification of dharmas” (dharma flawlessness) is the dharma, by awakening to which flawed dharmas are cut off.

source: །ཡང་དག་པའི་མཐའ་ཞེས་བྱ་བ་ནི་ཡང་དག་པ་དེ་ཁོ་ན་ཉིད་ཀྱི་དོན་གྱི་མཐའ་སྟེ། མཐར་ཕྱིན་པའི་ཕྱིར་ཡང་དག་པའི་མཐའ་ཤིན་ཏུ་ངེས་པ་དེ་ཁོ་ན་ཉིད་ཅེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: As for “the very limit of reality,” because it is the “limit” (what stands at the limit) of “reality” (in the sense of true reality), it means the true reality that has been absolutely determined to be at the limit of reality. “

source: །བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་ཞེས་བྱ་བ་ནི་བསམ་གྱིས་མི་ཁྱབ་པའི་ངོ་བོ་ཉིད་དེ།
en: The inconceivable element” is an inconceivable entity.

source: འཇིག་རྟེན་པའི་རྟོག་པ་ཐམས་ཅད་ཀྱི་རྗེས་སུ་དཔག་པའི་སྤྱོད་ཡུལ་མ་ཡིན་པས་ཤིན་ཏུ་ངེས་པ་སོ་སོ་རང་གིས་རིག་པ་དོན་དམ་པ་ལ་བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་ཤེས་བྱའོ།
en: It is not within the range of what can be inferred by any ordinary speculative thought, so the absolutely determined ultimate known by self-reflexive analytic knowledge is called the “inconceivable element.”

source: །ཡང་ན་ངོ་མཚར་རྨད་དུ་བྱུང་བའི་ཆོས་བསམ་གྱིས་མི་ཁྱབ་པ་རྣམས་ཀྱི་རྒྱུ་ཡིན་པའི་ཕྱིར། བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་ཏེ། སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཆོས་ཀྱི་སྐུའི་དབང་གིས་ཆོ་འཕྲུལ་ངོ་མཚར་རྣམས་འཇིག་རྟེན་དུ་འབྱུང་བའོ།
en: Alternatively, it is the element of what is inconceivable, because it is the cause of the amazing, marvelous, inconceivable attributes, which is to say, through the power of the body of the attributes of the buddhas and bodhisattvas the amazing miracles appear in the world. “

source: །དེ་ལ་གཟུགས་མི་དམིགས་གཟུགས་ཀྱི་དེ་བཞིན་ཉིད་མི་དམིགས་ཞེས་བྱ་བ་ནི་གཟུགས་ལ་སོགས་པའི་ཆོས་རྣམས་མེད་པའི་ཕྱིར་མི་དམིགས་སོ།
en: In them you cannot apprehend form, you cannot apprehend the suchness of form.” Phenomena, form and so on, do not exist, so you cannot apprehend them.

source: །དེ་བཞིན་ཉིད་ནི་དམིགས་པར་བྱ་བ་དང་། དམིགས་པར་བྱེད་པ་མཉམ་པ་ཉིད་དུ་གྱུར་པའི་གནས་སྐབས་ན། གཟུང་བ་དང་འཛིན་པའི་དངོས་པོ་མེད་པས་མི་དམིགས་སོ།
en: As for suchness, during the period when apprehended and apprehender are in the same state, you cannot apprehend it because that which might be grasped and a grasper do not exist.

source: །ཡང་ན་དྲི་མ་དང་བཅས་པ་དང་དྲི་མ་མེད་པའི་གནས་སྐབས་ཉིད་ལ་གཟུགས་ཀྱི་དེ་བཞིན་ཉིད་ཅེས་བྱ་བ་ལ་སོགས་པའི་སྒྲར་བརྗོད་པའི་ཕྱིར་དེ་སྐད་ཅེས་བྱའོ།
en: Alternatively, that is said because form and suchness are the terms used just during the periods together with stains and when there are no stains.

source: །དེའི་འོག་ཏུ་ཆོས་མངོན་པར་རྟོགས་པ་ནི་བརྡ་ཕྲད་སླ་བས་མ་བཀྲོལ་ལོ།
en: An exegesis of the clear realization of the dharmas is not given because it is easy to explain.

source: །བྱང་ཆུབ་སེམས་དཔའ་ཡོངས་སུ་ཉམས་པའི་ཆོས་ཅན་དྲུག་ཅུ་ནི་ཉེ་བར་ལེན་པ་མེད་པར་ཟག་པ་རྣམས་ལས་སེམས་རྣམ་པར་གྲོལ་ཞེས་བྱ་བ་ནི་ཅིའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ཡོངས་སུ་ཉམས་པའི་ཆོས་ཅན་ཡིན་ཞེ་ན།
en: Sixty bodhisattvas lacking in what is necessary stopped taking hold of anything and their minds were freed from contamination. Why are those bodhisattvas lacking in what is necessary?

source: འདི་ལྟར་དེ་དག་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཐབས་མཁས་པ་དང་བྲལ་བས་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་པོ་དག་ལ་དམིགས་པ་དང་བཅས་པའི་སྤྱོད་པ་སྤྱད་པས། དེའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་སྐྱོན་མེད་པར་མ་ཞུགས་ཤིང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་བསྒྲུབ་པར་མ་བྱས་པའོ། །དེ་དག་གིས་སྔོན་སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་སྨོན་པ་མེད་པའི་བསྒོམ་པ་དེས་རྣམ་པར་གྲོལ་བའི་སྒོ་ཐོབ་པར་གྱུར་ཏེ།
en: It is because, separated from the perfection of wisdom and skillful means, those bodhisattvas practiced a practice of six perfections that can be apprehended and therefore “did not enter into secure state,” and so they did not make unsurpassed, perfect, complete awakening their achievement.

source: དེའི་ཕྱིར་དེ་དག་གིས་ཡང་དག་པའི་མཐའ་མངོན་སུམ་དུ་བྱས་ནས་དགྲ་བཅོམ་པ་ཐོབ་པར་གྱུར་ཏོ།
en: Hence, they will actualize the very limit of reality and become worthy ones.

source: །སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་སྒོམ་པ་དེ་ཉིད་ཐབས་མཁས་པ་དང་བྲལ་བ་རྣམས་ནི་ཉན་ཐོས་སུ་འགྱུར་གྱི་མ་བྲལ་བ་རྣམས་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཐོབ་པར་འགྱུར་བ་འདི་ཅིའི་ཕྱིར་ཞེས་ཞུས་པ་དང་།
en: Those who do just that meditation on “emptiness, signlessness, and wishlessness… separated from skillful means… become śrāvakas,” while those who are not so separated reach unsurpassed, perfect, complete awakening. He asks “why?”

source: བྱའི་དཔེ་བསྟན་ཏོ། །ཐབས་མཁས་པ་བསྟན་པ་ཡང་བརྡ་ཕྲད་སླའོ།
en: and is taught with the illustration of “a bird,” and there is an explanation of skillful means. It is easy to understand. Is it hard or not hard to become awakened?

source: །དེ་ནས་གནས་བརྟན་ཤཱ་རིའི་བུས། བཅོམ་ལྡན་འདས་བདག་གིས་བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པའི་དོན་འཚལ་བ་ལྟར་ན་ཞེས་གསུངས་པ་ནི་རིགས་ཀྱི་བྱེ་བྲག་གིས་ཤེས་རབ་དང་ཐབས་ལ་མཁས་པ་འབྱུང་སྟེ། དེ་ལས་མི་དམིགས་པའི་བློ་སྐྱེ་ཞིང་། དེས་དེ་དག་ཐམས་ཅད་གྲུབ་པར་འགྱུར་རོ་ཞེས་བསྟན་ཏོ།
en: Then, in regard to the statement, “Lord,” said the elder Śāriputra, “the way I understand the meaning of what you, Lord, have said,” it is teaching that on account of their particular lineage they have wisdom and skillful means, their nonapprehending awareness arises from that, and with those everything is achieved. “

source: །སེམས་དང་པོ་བསྐྱེད་པ་ནས་ཉེ་བར་བཟུང་སྟེ་ཞེས་བྱ་བ་ནི་ས་དང་པོ་ཉེ་བར་བཟུང་སྟེ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: Starting from the production of the first thought” means starting from the first level. “

source: །ལྷའི་བུ་དག་ངས་ཀྱང་ཆོས་ཐམས་ཅད་རྣམ་པ་ཐམས་ཅད་དུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཏེ་ངས་ནི་གང་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བའམ།
en: Gods! Even though I have fully awakened to all dharmas in all their aspects, still I did not apprehend any dharma that might fully awaken, or through which I might fully awaken, or any dharma I might awaken to.”

source: གང་གིས་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བའམ། གང་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་བྱ་བའི་ཆོས་གང་མ་དམིགས་སོ་ཞེས་བྱ་བ་ནི་ངས་ཀུན་རྫོབ་ཀྱི་ཤེས་པ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱིས་བསྡུས་པས་ནི་ཆོས་ཐམས་ཅད་རྣམ་པ་ཐམས་ཅད་དུ་ཤེས་ཀྱི་དོན་དམ་པའི་ཡེ་ཤེས་ཀྱིས་རབ་ཏུ་རྣམ་པར་ཕྱེ་ན་རྨི་ལམ་ན་མཐོང་བའི་དོན་བཞིན་དུ་ཤེས་པར་བྱེད་པའམ། ཤེས་པར་བྱ་བའི་ཆོས་གང་ཡང་མ་མཐོང་ངོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: This means he fully knows all the dharmas that have been brought together in a conventional state of consciousness—the knowledge of a knower of all aspects—but when they are investigated with the knowledge of the ultimate, like seeing things in a dream, he does not see any dharma that knows or that might be known. “

source: །ལྷའི་བུ་དག་ཆོས་ཐམས་ཅད་ཤིན་ཏུ་རྣམ་པར་དག་པའི་ཕྱིར་རོ་ཞེས་བྱ་བ་ནི་འདིར་དངོས་པོ་མེད་པ་ཉིད་ལ་རྣམ་པར་དག་པ་ཞེས་བྱ་སྟེ་ཤིན་ཏུ་མེད་པ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: And why? Gods, it is because all dharmas are absolutely pure.” Here the “pure” is just the nonexistent thing, in the sense of absolutely nonexistent. “

source: །བཅོམ་ལྡན་འདས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ནི་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་བགྱི་བ་ནི་མི་དཀའོ་ཞེས་བྱ་བ་ནི།
en: Lord… full awakening to unsurpassed, perfect, complete awakening is not hard.”

source: ཆོས་ཐམས་ཅད་མེད་པའི་ཕྱིར་ཏེ་དངོས་པོ་མེད་པ་ལ་དངོས་པོ་མེད་པར་རྟོགས་པར་བྱ་བ་ནི་མི་དཀའི།
en: All dharmas are nonexistent, that is, are nonexistent things, so it is not hard to realize that a nonexistent thing is a nonexistent thing.

source: ཡོད་པའི་ཆོས་རྣམས་ཀྱི་མཚན་ཉིད་ཡང་དག་པ་ཇི་ལྟ་བ་ཉིད་རྟོགས་པར་བྱ་བ་ནི་དཀའོ།
en: It is hard to correctly realize the defining marks of phenomena that exist.

source: །མེད་པ་ལ་དངོས་པོ་མེད་པ་ཙམ་དུ་ཤེས་ཤིང་སྒྲུབ་པ་ནི་མི་དཀའ་སྟེ། འདི་ལྟར་ཆོས་རྣམས་ཡོད་པ་ལ་ནི་དཀར་པོའི་ཆོས་འཕེལ་བར་བྱ་བ་དང་། ནག་པོའི་ཆོས་སྤང་བར་བྱ་བའི་ཕྱིར་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སོགས་པའི་སྤྱོད་པ་བསྒྲུབ་དགོས་པར་འགྱུར་ན།
en: When something is nonexistent, knowing and establishing that it is simply a nonexistent thing is not hard, even though it would be were dharmas to have such an existence and were you to have to accomplish the practice of the perfections and so on to increase the bright dharmas and stop the dark dharmas.

source: གང་གི་ཕྱིར་ཆོས་འདི་རྣམས་མེད་པ་དེའི་ཕྱིར་སྒྲུབ་པ་ཡང་མི་དཀའ་འོ།
en: But because those dharmas do not exist, therefore even the accomplishment of them is not hard.

source: །དེ་བས་ན་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་མི་དཀའ་འོ་ཞེས་བྱ་བ་གསུངས་སོ།
en: So, he says “full awakening… is not hard.”

source: །གནས་བརྟན་ཤཱ་རིའི་བུས་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་དཀའ་བར་གསུངས་པ་དེའི་དགོངས་པ་ནི་འདི་ལྟ་སྟེ། ཆོས་ཐམས་ཅད་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་དེ་ནམ་མཁའ་ལྟ་བུར་དངོས་པོ་མེད་པར་རིག་ནས། གལ་ཏེ་མི་སྨྲ་བར་འདུག་པས་ཆོག་ན་དེ་ལྟར་ན་ནི་དཀའ་བ་མ་ཡིན་པར་འགྱུར་ན།
en: The elder Śāriputra’s intention in saying full awakening “must be hard” is this: Having understood that the intrinsic nature of all phenomena that are nonexistent things is a nonexistent thing, like space, then, if it were enough to remain silent in that case it would not be hard.

source: འདི་ལྟར་ཡང་དག་པར་ན་ཆོས་ཐམས་ཅད་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པ་མེད་པར་ཡང་རིག་པར་བྱས་ལ། དེའི་འོག་ཏུ་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྤྱོད་པ་རྣམས་ལ་ཡང་སྦྱོར་ཞིང་། ཆོས་ཐམས་ཅད་ཀྱང་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་བྱེད་ན་དེ་ལྟ་བུ་ན་ནི་དཀའ་འོ་ཞེས་བྱ་བར་དགོངས་པའོ།
en: But having thus come to understand that ultimately even full awakening to all dharmas does not exist, and yet, after that still making an effort at the practices of the perfections and working at becoming fully awakened to all dharmas—that sort of thing is hard.

source: །གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཐམས་ཅད་ནམ་མཁའ་ལྟ་བུར་མོས་པར་མི་བྱེད་ཀྱང་ཞེས་བྱ་བ་ལ་སོགས་པས་ནི་འདི་སྐད་སྟོན་ཏེ། །གལ་ཏེ་ཆོས་ཐམས་ཅད་ཤིན་ཏུ་མེད་པའི་ཕྱིར་ནམ་མཁའ་ལྟ་བུར་མོས་པར་མ་བྱས་ཀྱང་བྱང་ཆུབ་འཐོབ་པར་འགྱུར་ན་ནི་དེ་ལྟ་ན་སླ་སྟེ་དཀའ་བ་མ་ཡིན་ནོ།
en: That is what he intends. “If bodhisattva great beings do not believe that dharmas are like space, but still,” and so on, teaches that if they were not to “believe all dharmas,” because they are nonexistent, “are like space, but still” they could reach awakening, in that case it would be easy, “it would not be hard.”

source: །གལ་ཏེ་དེ་ལྟར་གྱུར་ན་འཇིག་རྟེན་ན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལ་སྤྱད་པ་དག་དམིགས་པའི་འདུ་ཤེས་མ་སྤངས་པས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་ལྡོག་པར་ཡང་མི་འགྱུར་ལ་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་སར་ལྷུང་བར་ཡང་མི་འགྱུར་བ་ཞིག་ན།
en: And if that were the case, even in the world, bodhisattva great beings who have not eliminated the notion that something is being apprehended, who are practicing the six perfections, would not turn back from unsurpassed, perfect, complete awakening and would not fall to the śrāvaka or pratyekabuddha level.

source: གང་གི་ཕྱིར་དེ་ལྟར་དམིགས་པ་ཅན་དུ་སྤྱོད་པ་རྣམས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་མེད་པས། དེའི་ཕྱིར་ཆོས་དེ་དག་ཉིད་ཤིན་ཏུ་དངོས་པོ་མེད་པར་མཐོང་བས་ཆོས་དེ་དག་ཉིད་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་བ་དེ་དཀའོ་ཞེས་བསྟན་པའོ།། །།བམ་པོ་ཉི་ཤུ་གཉིས་པ། དེ་སྐད་སྨྲས་པ་དང་།
en: This is teaching that in fact those who practice while apprehending things like that will not fully awaken to unsurpassed, perfect, complete awakening, and therefore that full awakening to just those dharmas by seeing that just those dharmas are absolutely nonexistent things is hard.

source: གནས་བརྟན་རབ་འབྱོར་གྱིས་བྱང་ཆུབ་སེམས་དཔའ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་ལྡོག་གོ་ཞེས་བྱ་བ་དེ་མ་བཟོད་ནས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་དེ་ཇི་སྙམ་དུ་སེམས་གཟུགས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ལྡོག་གམ་ཞེས་བྱ་བ་ལ་སོགས་པ་གསུངས་སོ།
en: Having said this, the elder Subhūti, impatient with his statement that bodhisattva great beings turn back from perfect, complete awakening, says, “Venerable Śāriputra, what do you think, does form turn back from unsurpassed, perfect, complete awakening?” and so on.

source: །འདིར་ཡང་རྣམ་པ་དྲུག་སྟོན་ཏེ། གཟུགས་ལ་སོགས་པའི་ཆོས་རྣམས་ཕྱིར་ལྡོག་གམ། གཟུགས་ལ་སོགས་པ་ལས་གཞན་པའི་ཆོས་འགའ་ཞིག་ཕྱིར་ལྡོག་གམ། གཟུགས་ལ་སོགས་པའི་ཆོས་རྣམས་ཀྱི་དེ་བཞིན་ཉིད་དྲི་མ་དང་བཅས་པའི་ཆོས་འགའ་ཞིག་ཕྱིར་ལྡོག་གམ། གཟུགས་ལ་སོགས་པའི་དེ་བཞིན་ཉིད་ལས་གཞན་པའི་ཆོས་འགའ་ཞིག་ཕྱིར་ལྡོག་གམ།
en: Here again it teaches six ways it could happen: You can suppose that a dharma, form and so on, turns back; or a dharma other than form turns back; or some dharma that is the suchness of the dharmas, form and so on with stains, turns back; or some dharma other than the suchness of form and so on turns back; or absolutely pure, stainless suchness turns back; or some dharma other than that turns back.

source: དེ་བཞིན་ཉིད་ཤིན་ཏུ་རྣམ་པར་དག་པ་དྲི་མ་མེད་པ་གང་ཡིན་པ་དེ་ཕྱིར་ལྡོག་གམ། དེ་ལས་གཞན་པའི་ཆོས་འགའ་ཞིག་ཕྱིར་ལྡོག་གྲང་ན། དེ་ལྟར་ཆོས་རྣམས་དྲུག་པོ་དེ་དག་མེད་ན་གང་ཕྱིར་ལྡོག་པར་འགྱུར་བའི་ཆོས་བདེན་པར་གནས་པ་དེ་གང་ཞིག་ཡོད་དེ།
en: Given that it could not happen in those six ways, what truly established dharma is there that will turn back?

source: དེ་བས་ན་དོན་དམ་པར་ཕྱིར་ལྡོག་པར་འགྱུར་བ་གང་ཡང་མེད་དོ་ཞེས་བསྟན་པའོ།
en: This is teaching that ultimately, therefore, there is nothing at all that turns back.

source: །གནས་བརྟན་རབ་འབྱོར་གྱིས་ཆོས་ཀྱི་ཚུལ་གྱི་རྣམ་པ་དེས་བསྟན་པ་ལྟར་ན་ཞེས་བྱ་བ་ལ་སོགས་པས་ནི་གནས་བརྟན་ཤཱ་རིའི་བུས་འདི་སྐད་སྨྲས་ཏེ། གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་ཕྱིར་ལྡོག་པ་མེད་ན། དེ་ལྟ་ན་ནི་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་སངས་རྒྱས་སུ་འགྱུར་གྱི། ཕྱིར་ལོག་ནས་ཉན་ཐོས་དང་རང་སངས་རྒྱས་སུ་མི་འགྱུར་རོ། །དེ་ལྟར་གྱུར་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པ་གསུམ་མོ་ཞེས་བྱ་བ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་རྣམ་པ་གསུམ་དུ་འགྱུར་བ་མེད་དོ་ཞེས་དེ་སྙམ་དུ་བསམས་པ་དང་།
en: With “according to the way things are in the elder Subhūti’s teaching,” and so on, the elder Śāriputra is saying that if there are no bodhisattvas who turn back from progress toward awakening, in that case all bodhisattvas will become buddhas; they will not turn back to become śrāvakas or pratyekabuddhas, having in mind that were that to be the case there would not be the three types of bodhisattvas where it says “the bodhisattva is threefold.”

source: གནས་བརྟན་གང་པོའི་ཚིག་གིས་རབ་འབྱོར་ལ་ཡང་དྲིས་པ་དང་། དེ་ནས་གནས་བརྟན་རབ་འབྱོར་གྱིས་བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པ་གསུམ་ཞེས་བྱ་བའི་ཚིག་དེ་མ་བཟོད་ནས། ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་ཁྱོད་དེ་བཞིན་ཉིད་ལ་བྱང་ཆུབ་སེམས་དཔའ་གསུམ་འདོད་དམ་ཞེས་བྱ་བ་ལ་སོགས་པ་གསུངས་ཏེ།
en: He questions Subhūti with the elder Pūrṇa’s words, and then the elder Subhūti, impatient with the words “the bodhisattva is threefold” says, “Venerable Śāriputra, do you accept in suchness there are three bodhisattvas?” and so on.

source: བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་ཐམས་ཅད་དང་འཕགས་པའི་གང་ཟག་ཐམས་ཅད་དང་། རང་བྱང་ཆུབ་དང་། བྱང་ཆུབ་སེམས་དཔའ་དང་། སངས་རྒྱས་ཀྱང་དེ་བཞིན་ཉིད་ཀྱི་དབང་གིས་གཅིག་ཁོ་ནར་འགྱུར་ཏེ། དེ་དག་ལ་ཐ་དད་པ་མེད་དོ་ཞེས་སྔར་ཡང་བཤད་ཟིན་ཏོ།
en: As already explained before, from the perspective of suchness all childish ordinary persons, all noble persons, those with a pratyekabuddha’s awakening, bodhisattvas, and even buddhas are just simply one, there is no difference among them.

source: །དེ་ལྟར་ཐམས་ཅད་གཅིག་ཏུ་ཟད་པ་ལ་བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པ་གསུམ་དུ་འདོད་ན། དེ་བཞིན་ཉིད་རྣམ་པ་ཐམས་ཅད་དུ་ཐ་དད་པ་མེད་པ་ལ། གཅིག་གམ་གཉིས་སམ་གསུམ་ཞེས་ཐ་དད་དུ་དབྱེ་བ་ཇི་ལྟར་རིགས་པར་འགྱུར་ཞེས་བསྟན་པའོ།
en: This is explaining that if, even while all are thus just simply one, you accept that bodhisattvas are of three types, then how, given that suchness is totally without difference, can it be feasible to divide it into “one… or two… or three” subdivisions?

source: །དེ་ནས་གནས་བརྟན་རབ་འབྱོར་ལ་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་འདི་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་རིག་པར་བྱའོ་ཞེས་གསུངས་པའི་སྐབས་ལས་ངེས་པར་འབྱུང་བ་བསྒྲུབ་པའི་མཚན་ཉིད་ཤེས་པར་འདོད་པའི་འཁོར་རྣམས་ཀྱི་དོན་དུ། བཅོམ་ལྡན་འདས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་འཚལ་བའི་བྱང་ཆུབ་སེམས་དཔས་ཇི་ལྟར་གནས་པར་བགྱི་ཞེས་ཞུས་པ་དང་།
en: Then the Lord says to the elder Subhūti that he should know that those bodhisattvas will go forth to unsurpassed, perfect, complete awakening, and in that context, for the sake of those in the retinue who want to know the defining marks of those who will succeed in going forth, Subhūti asks, “Lord, how should bodhisattva great beings who want to go forth to unsurpassed, perfect, complete awakening stand?”

source: དེའི་འོག་ཏུ་བསམ་པ་ཕུན་སུམ་ཚོགས་པ་དང་། སྦྱོར་བ་ཕུན་སུམ་ཚོགས་པས་གནས་པར་བསྟན་པ།
en: After that there is the explanation that they stand with a fully complete aspiration and a fully complete practice.

source: སེམས་ཅན་ཐམས་ཅད་ལ་སེམས་མཉམ་པ་ཉིད་དུ་བསྐྱེད་པར་བྱའོ་ཞེས་བྱ་བ་ནས་ཉེ་དུ་དང་སྣག་གི་གཉེན་མཚམས་ཀྱི་སེམས་ཀྱིས་དམིགས་པར་བྱའོ་ཞེས་བྱ་བའི་བར་དུ་ནི་བསམ་པ་ཕུན་སུམ་ཚོགས་པའོ།
en: The fully complete aspiration is from “I must produce a balanced thought toward all beings,” up to “I must focus on all beings with the thought they are kinsmen, and blood relatives.”
